Terraform Plan:

https://github.com/connormaglynn/infrastructure/pull/37/checks#step:5:1

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/connormaglynn/github/runs/run-H9ubBC5tbJbH7xkd

Waiting for the plan to start...

Terraform v1.6.6
on linux_amd64
Initializing plugins and modules...
github_repository.repositories["connorglynn.com"]: Preparing import... [id=connorglynn.com]
github_repository.repositories["typescript-template"]: Preparing import... [id=typescript-template]
github_repository.repositories["garrettys.com"]: Preparing import... [id=garrettys.com]
github_repository.repositories["learning-golang"]: Preparing import... [id=learning-golang]
github_repository.repositories["gemsbook-keeping.co.uk"]: Preparing import... [id=gemsbook-keeping.co.uk]
github_repository.repositories["imust-cli"]: Preparing import... [id=imust-cli]
github_repository.repositories["gemsbook-keeping.co.uk"]: Refreshing state... [id=gemsbook-keeping.co.uk]
github_repository.repositories["connorglynn.com"]: Refreshing state... [id=connorglynn.com]
github_repository.repositories["garrettys.com"]: Refreshing state... [id=garrettys.com]
github_repository.repositories["learning-golang"]: Refreshing state... [id=learning-golang]
github_repository.repositories["typescript-template"]: Refreshing state... [id=typescript-template]
github_repository.repositories["advent-of-code-typescript"]: Refreshing state... [id=advent-of-code-typescript]
github_repository.repositories["imust-cli"]: Refreshing state... [id=imust-cli]
github_repository.repositories["scripts"]: Refreshing state... [id=scripts]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["tillysofcastleton.com"]: Preparing import... [id=tillysofcastleton.com]
github_repository.repositories["tillysofcastleton.com"]: Refreshing state... [id=tillysofcastleton.com]
github_repository.repositories["shopping-cart-typescript"]: Preparing import... [id=learning-python]
github_repository.repositories["shopping-cart-typescript"]: Refreshing state... [id=learning-python]
github_repository.repositories["firebase-playground"]: Preparing import... [id=firebase-playground]
github_repository.repositories["firebase-playground"]: Refreshing state... [id=firebase-playground]
github_repository.repositories["developer-navigation-browser-plugin"]: Preparing import... [id=developer-navigation-browser-plugin]
github_repository.repositories["developer-navigation-browser-plugin"]: Refreshing state... [id=developer-navigation-browser-plugin]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.repositories["advent-of-code-typescript"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "advent-of-code-typescript"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "advent-of-code-typescript"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        # (28 unchanged attributes hidden)

      - template {
          - include_all_branches = false -> null
          - owner                = "connormaglynn" -> null
          - repository           = "typescript-template" -> null
        }

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["connorglynn.com"] will be updated in-place
  # (imported from "connorglynn.com")
  ~ resource "github_repository" "repositories" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = false
      ~ allow_squash_merge          = false -> true
        allow_update_branch         = false
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "This repository is managed in Terraform"
        etag                        = "W/\"144acd6d713f6a0ab1c4ae3a57e90cbae9b8b0ac1d7396a1210024bf9abdf0b6\""
        full_name                   = "connormaglynn/connorglynn.com"
        git_clone_url               = "git://github.com/connormaglynn/connorglynn.com.git"
        has_discussions             = false
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        html_url                    = "https://github.com/connormaglynn/connorglynn.com"
        http_clone_url              = "https://github.com/connormaglynn/connorglynn.com.git"
        id                          = "connorglynn.com"
        is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "connorglynn.com"
        node_id                     = "R_kgDOG1HeLA"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 458350124
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:connormaglynn/connorglynn.com.git"
        svn_url                     = "https://github.com/connormaglynn/connorglynn.com"
        topics                      = []
        visibility                  = "public"
      - vulnerability_alerts        = true -> null

      - pages {
          - build_type = "workflow" -> null
          - cname      = "connorglynn.com" -> null
          - custom_404 = false -> null
          - html_url   = "https://connorglynn.com/" -> null
          - status     = "built" -> null
          - url        = "https://api.github.com/repos/connormaglynn/connorglynn.com/pages" -> null

          - source {
              - branch = "main" -> null
              - path   = "/" -> null
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.repositories["developer-navigation-browser-plugin"] will be updated in-place
  # (imported from "developer-navigation-browser-plugin")
  ~ resource "github_repository" "repositories" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = false
      ~ allow_squash_merge          = false -> true
        allow_update_branch         = false
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "A browser extension to help developers navigate between various web tooling" -> "This repository is managed in Terraform"
        etag                        = "W/\"afb88cbee067eaa7c084f84465e55ea4215e33682bdd54e0983fddd8e4456bb3\""
        full_name                   = "connormaglynn/developer-navigation-browser-plugin"
        git_clone_url               = "git://github.com/connormaglynn/developer-navigation-browser-plugin.git"
        has_discussions             = false
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        html_url                    = "https://github.com/connormaglynn/developer-navigation-browser-plugin"
        http_clone_url              = "https://github.com/connormaglynn/developer-navigation-browser-plugin.git"
        id                          = "developer-navigation-browser-plugin"
        is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "developer-navigation-browser-plugin"
        node_id                     = "R_kgDOHuyV-g"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 518821370
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:connormaglynn/developer-navigation-browser-plugin.git"
        svn_url                     = "https://github.com/connormaglynn/developer-navigation-browser-plugin"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.repositories["firebase-playground"] will be updated in-place
  # (imported from "firebase-playground")
  ~ resource "github_repository" "repositories" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = false
      ~ allow_squash_merge          = false -> true
        allow_update_branch         = false
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "A playground for Firebase 🔥🔥🔥" -> "This repository is managed in Terraform"
        etag                        = "W/\"2c1816cdb930640755df2404a7221cf59bb3515593c6d8947e5f1cc87086cdf2\""
        full_name                   = "connormaglynn/firebase-playground"
        git_clone_url               = "git://github.com/connormaglynn/firebase-playground.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = false
        has_projects                = false
        has_wiki                    = false
      - homepage_url                = "https://firebase-playground.connorglynn.com" -> null
        html_url                    = "https://github.com/connormaglynn/firebase-playground"
        http_clone_url              = "https://github.com/connormaglynn/firebase-playground.git"
        id                          = "firebase-playground"
        is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "firebase-playground"
        node_id                     = "R_kgDOJsGskw"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 650226835
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:connormaglynn/firebase-playground.git"
        svn_url                     = "https://github.com/connormaglynn/firebase-playground"
        topics                      = [
            "firebase",
            "github-actions",
            "nextjs13",
            "typescript",
        ]
        visibility                  = "public"
        vulnerability_alerts        = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.repositories["garrettys.com"] will be updated in-place
  # (imported from "garrettys.com")
  ~ resource "github_repository" "repositories" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = false
      ~ allow_squash_merge          = false -> true
        allow_update_branch         = false
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "master"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "This repository is managed in Terraform"
        etag                        = "W/\"e44e3a764e65e4ecc4a1d8fa06792e19e7a2ec124b7a4717e15ec1a7964caf1f\""
        full_name                   = "connormaglynn/garrettys.com"
        git_clone_url               = "git://github.com/connormaglynn/garrettys.com.git"
        has_discussions             = false
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        html_url                    = "https://github.com/connormaglynn/garrettys.com"
        http_clone_url              = "https://github.com/connormaglynn/garrettys.com.git"
        id                          = "garrettys.com"
        is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "garrettys.com"
        node_id                     = "MDEwOlJlcG9zaXRvcnkxNzM1MDUyODE="
        primary_language            = "HTML"
        private                     = false
        repo_id                     = 173505281
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:connormaglynn/garrettys.com.git"
        svn_url                     = "https://github.com/connormaglynn/garrettys.com"
        topics                      = []
        visibility                  = "public"
      - vulnerability_alerts        = true -> null

      - pages {
          - build_type = "legacy" -> null
          - custom_404 = false -> null
          - html_url   = "https://connormaglynn.github.io/garrettys.com/" -> null
          - status     = "built" -> null
          - url        = "https://api.github.com/repos/connormaglynn/garrettys.com/pages" -> null

          - source {
              - branch = "master" -> null
              - path   = "/" -> null
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.repositories["gemsbook-keeping.co.uk"] will be updated in-place
  # (imported from "gemsbook-keeping.co.uk")
  ~ resource "github_repository" "repositories" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = false
      ~ allow_squash_merge          = false -> true
        allow_update_branch         = false
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "master"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "This repository is managed in Terraform"
        etag                        = "W/\"7baaa4adf484c0a41f3ce11f8c70689121e86cb1f5e4fcf9f9318df05212f2c3\""
        full_name                   = "connormaglynn/gemsbook-keeping.co.uk"
        git_clone_url               = "git://github.com/connormaglynn/gemsbook-keeping.co.uk.git"
        has_discussions             = false
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        html_url                    = "https://github.com/connormaglynn/gemsbook-keeping.co.uk"
        http_clone_url              = "https://github.com/connormaglynn/gemsbook-keeping.co.uk.git"
        id                          = "gemsbook-keeping.co.uk"
        is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "gemsbook-keeping.co.uk"
        node_id                     = "MDEwOlJlcG9zaXRvcnkxNzM1MDU1OTU="
        primary_language            = "HTML"
        private                     = false
        repo_id                     = 173505595
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:connormaglynn/gemsbook-keeping.co.uk.git"
        svn_url                     = "https://github.com/connormaglynn/gemsbook-keeping.co.uk"
        topics                      = []
        visibility                  = "public"
      - vulnerability_alerts        = true -> null

      - pages {
          - build_type = "legacy" -> null
          - custom_404 = false -> null
          - html_url   = "https://connormaglynn.github.io/gemsbook-keeping.co.uk/" -> null
          - status     = "built" -> null
          - url        = "https://api.github.com/repos/connormaglynn/gemsbook-keeping.co.uk/pages" -> null

          - source {
              - branch = "master" -> null
              - path   = "/" -> null
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.repositories["imust-cli"] will be updated in-place
  # (imported from "imust-cli")
  ~ resource "github_repository" "repositories" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = false
      ~ allow_squash_merge          = false -> true
        allow_update_branch         = false
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "a command line tool for developers" -> "This repository is managed in Terraform"
        etag                        = "W/\"90a119a36d9955af9e129589c9d83d311149e1c6f3e034df61aa566bcec22b54\""
        full_name                   = "connormaglynn/imust-cli"
        git_clone_url               = "git://github.com/connormaglynn/imust-cli.git"
        has_discussions             = false
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        html_url                    = "https://github.com/connormaglynn/imust-cli"
        http_clone_url              = "https://github.com/connormaglynn/imust-cli.git"
        id                          = "imust-cli"
        is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "imust-cli"
        node_id                     = "R_kgDOHp2_iQ"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 513654665
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:connormaglynn/imust-cli.git"
        svn_url                     = "https://github.com/connormaglynn/imust-cli"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.repositories["infrastructure"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "infrastructure"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "infrastructure"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["learning-golang"] will be updated in-place
  # (imported from "learning-golang")
  ~ resource "github_repository" "repositories" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = false
      ~ allow_squash_merge          = false -> true
        allow_update_branch         = false
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "A repository for learning GoLang" -> "This repository is managed in Terraform"
        etag                        = "W/\"4358dbf3d36fbe854fc7766cf690e82b738bd9eb8425513f4b8caf3512db03b7\""
        full_name                   = "connormaglynn/learning-golang"
        git_clone_url               = "git://github.com/connormaglynn/learning-golang.git"
        has_discussions             = false
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        html_url                    = "https://github.com/connormaglynn/learning-golang"
        http_clone_url              = "https://github.com/connormaglynn/learning-golang.git"
        id                          = "learning-golang"
        is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "learning-golang"
        node_id                     = "R_kgDOKQnXXg"
        primary_language            = "Go"
        private                     = false
        repo_id                     = 688510814
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:connormaglynn/learning-golang.git"
        svn_url                     = "https://github.com/connormaglynn/learning-golang"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.repositories["learning-python"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "This repository is managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "learning-python"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
    }

  # github_repository.repositories["shopping-cart-typescript"] will be updated in-place
  # (imported from "learning-python")
  ~ resource "github_repository" "repositories" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = false
      ~ allow_squash_merge          = false -> true
        allow_update_branch         = false
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "A repository to hold python learning exercises" -> "This repository is managed in Terraform"
        etag                        = "W/\"38faa7e11ff1b67239781ca4b4ce3f5bd4bd5183a38e8f29060e372f6d49dd7b\""
      ~ full_name                   = "connormaglynn/learning-python" -> (known after apply)
        git_clone_url               = "git://github.com/connormaglynn/learning-python.git"
        has_discussions             = false
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        html_url                    = "https://github.com/connormaglynn/learning-python"
        http_clone_url              = "https://github.com/connormaglynn/learning-python.git"
        id                          = "learning-python"
        is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      ~ name                        = "learning-python" -> "shopping-cart-typescript"
        node_id                     = "R_kgDOI4_KWA"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 596626008
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:connormaglynn/learning-python.git"
        svn_url                     = "https://github.com/connormaglynn/learning-python"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.repositories["tillysofcastleton.com"] will be updated in-place
  # (imported from "tillysofcastleton.com")
  ~ resource "github_repository" "repositories" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = false
      ~ allow_squash_merge          = false -> true
        allow_update_branch         = false
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "A sample bakery site" -> "This repository is managed in Terraform"
        etag                        = "W/\"f035b2ad39aa247f3164b3a8aa03e1a5ba9b1f81f751c4f084da3c7ba66c5fd9\""
        full_name                   = "connormaglynn/tillysofcastleton.com"
        git_clone_url               = "git://github.com/connormaglynn/tillysofcastleton.com.git"
        has_discussions             = false
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
      - homepage_url                = "https://tillysofcastleton.connorglynn.com" -> null
        html_url                    = "https://github.com/connormaglynn/tillysofcastleton.com"
        http_clone_url              = "https://github.com/connormaglynn/tillysofcastleton.com.git"
        id                          = "tillysofcastleton.com"
        is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "tillysofcastleton.com"
        node_id                     = "R_kgDOJqsK7g"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 648743662
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:connormaglynn/tillysofcastleton.com.git"
        svn_url                     = "https://github.com/connormaglynn/tillysofcastleton.com"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = false

      - pages {
          - build_type = "workflow" -> null
          - cname      = "tillysofcastleton.connorglynn.com" -> null
          - custom_404 = false -> null
          - html_url   = "https://tillysofcastleton.connorglynn.com/" -> null
          - url        = "https://api.github.com/repos/connormaglynn/tillysofcastleton.com/pages" -> null

          - source {
              - branch = "main" -> null
              - path   = "/" -> null
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.repositories["typescript-template"] will be updated in-place
  # (imported from "typescript-template")
  ~ resource "github_repository" "repositories" {
        allow_auto_merge            = false
        allow_merge_commit          = false
        allow_rebase_merge          = false
      ~ allow_squash_merge          = false -> true
        allow_update_branch         = false
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "a base template for typescript projects" -> "This repository is managed in Terraform"
        etag                        = "W/\"807c2ebdfc1cc022a03a996bfb689372738829e5fe6085e81afd359ca5dad620\""
        full_name                   = "connormaglynn/typescript-template"
        git_clone_url               = "git://github.com/connormaglynn/typescript-template.git"
        has_discussions             = false
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        html_url                    = "https://github.com/connormaglynn/typescript-template"
        http_clone_url              = "https://github.com/connormaglynn/typescript-template.git"
        id                          = "typescript-template"
        is_template                 = true
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "typescript-template"
        node_id                     = "R_kgDOHqOgoQ"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 514039969
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        ssh_clone_url               = "git@github.com:connormaglynn/typescript-template.git"
        svn_url                     = "https://github.com/connormaglynn/typescript-template"
        topics                      = []
        visibility                  = "public"
      - vulnerability_alerts        = true -> null

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

Plan: 10 to import, 1 to add, 12 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 14 estimated
           $0.0/mo +$0.0

```